app/controllers/rubyists_controller.rb

  def index
    @rubyists = Rubyist.all
---
SELECT * FROM "rubyists"

  def show
    @rubyist = Rubyist.find(params[:id])
    @updates = StatusUpdate.paginate(:page => params[:page], :per_page => 10, :conditions => ["rubyist_id = ?", @rubyist.id], :order => "twitter_date DESC")
---
SELECT * FROM "rubyists" WHERE ("rubyists"."id" = 1)
SELECT * FROM "status_updates" WHERE ("status_updates".rubyist_id = 1)