app/controllers/status_updates_controller.rb

SELECT * FROM "status_updates"
---
  def index
    @status_updates = StatusUpdate.all

SELECT * FROM "status_updates" WHERE ("status_updates"."id" = 1)
---
  def show
    @status_update = StatusUpdate.find(params[:id])

SELECT * FROM "status_updates" WHERE ("status_updates"."id" = 1)
---
  def edit
    @status_update = StatusUpdate.find(params[:id])

SELECT * FROM "status_updates" WHERE ("status_updates"."id" = 1)
UPDATE "status_updates" SET "updated_at" = '2010-01-09 06:06:02', "translated_text" = 'Not much time, you know.' WHERE "id" = 1
---
  def update
    @status_update = StatusUpdate.find(params[:id])
    if @status_update.update_attributes(params[:status_update])